Tekla Open API Reference for Tekla Structures 2025
IIntDataType Interface
 The IIntDataType interface is an interface for the Tekla.Structures.Datatype.* types whose value is an integer.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public interface IIntDataType : IDataType
Public Interface IIntDataType
	Inherits IDataType
The IIntDataType type exposes the following members.
Properties
Name | Description
Value
 The integer value of the field.
Top
See Also
Reference
Tekla.Structures.Datatype Namespace